# Constraints and Triggers
### 67-262 Database Design and Development, Fall 2016

**C**onfidentiality, **I**ntegrity, and **A**vailability are the main quaility attributes (non-functional requirements) for Information Security. At a low level data types help maintain consistency.  A _data type_ is a set of values + operations on those values.  SQL provides a number of data types.  For details on the data types in Postgres please refer to https://www.postgresql.org/docs/current/static/datatype.html . In addition to the built in data types, Postgres supports the definition of our own via enumerated types https://www.postgresql.org/docs/current/static/datatype-enum.html 

Constraints and triggers are SQL DDL constructs that help maintain data integrity.  

**Constraints**, in the spirit of data types, place restrictions on allowable database values.  Some of the type of constraints are:

* _non-null constraints._ We try to avoid NULL values as it's semantics is  ambiguous. NULL Could meean unavailable (e.g., graduation GPA), unknown (e.g., patient's home phone#), not applicable (e.g., questions about guardian when patient himself is filling form).
  ```sql
  CREATE TABLE T1( 
         attr dataType NOT NULL,
         ...
         )
   ```
  
* _key constraints (entity integrity)_. Guarantee unique identifiability of a row in a table
  ```sql
  CREATE TABLE T2( 
         PRIMARY KEY(id),
         id int
         ...)
         ```
* _uniqueness constraints._ Guarantee uniqueness of values in a column.
  ```sql
  CREATE TABLE T3( 
         attr_1 dataType_1, 
         attr_2 dataType_2, 
         UNIQUE( attr_1, attr_2 )
         ...
         )```
         
* _attribute restrictions._ In additional to the value constraints imposed by the data type of a field (attribute) impose additional constraints e.g., acceptable range of values.

  ```sql
  CREATE TABLE T4( 
         gpa numeric(3,2) 
              check(0 < gpa and gpa <= 4.0)
         ...)```
         
* _referential integrity (aka foreign keys)_.  Restricts foreign keys in a table to primary keys in another table.

  ```sql
  CREATE TABLE T5( 
         fk int, 
         FOREIGN KEY(fk) REFERENCES T6(pk) 
         -- T6 is some other table
         ...
         )```
   In addition `restrict, set null, set default`, and `cascade` rules may also be imposed for  `update` or `delete` operations. 
         

**Triggers** are procedures that run when specified events in a database  table occur.  They are useful for implementing monitoring logic at the database level.

* delete/update/insert
* before/after/instead of
* when(condition)
* row-level/statement level


##  Constraints

### Start Postgres and from psql create the database 'constraints'
```
   % psql -d postgres -U isdb16
   postgres=# DROP DATABASE IF EXISTS Constraints;
   postgres=# CREATE DATABASE Constraints;
   postgres=# \c Constraints
```

In [ ]:
%load_ext sql

**Note:  You may need to specify a different user and password**

postgresql://user:password@localhost/constraints

In [ ]:
%%sql
postgresql://isdb16@localhost/constraints

For the below tables we are going to specify meaningful constraints.  First lets drop the tables if they already exists (e.g., when running the SQL code again.)

In [ ]:
%%sql
drop table if exists Students CASCADE;
drop table if exists Courses CASCADE;
drop table if exists Grades CASCADE;

For now ignore the `Courses` and `Grades` tables.  
Later you will cut and paste the below tables into the cell below with constraints
```
create table Courses(
    cId int,  
    name text,
    units int
);

create table Grades(
    sId int, 
    cId int, 
    letter_grade CHAR(2)
);
```

In [ ]:
%%sql
create table Students(
    sId  int,
    name text,
    gpa  numeric(3,2) 
);

In [ ]:
%%sql
INSERT INTO Students (sid, name, gpa) 
     VALUES (1, 'Jack', 2.3);

SELECT * from Students;

The next two inserts should be fine:

In [ ]:
%%sql
INSERT INTO Students (sid, name, gpa) 
     VALUES (2, 'Jill', 3.3);

SELECT * from Students;

In [ ]:
%%sql
INSERT INTO Students (sid, name, gpa) 
     VALUES (3, 'Jack', 3.9);

SELECT * from Students;

What about the next?  We are inserting another row with the same primary key?  Or are we ...?

In [ ]:
%%sql
INSERT INTO Students (sid, name, gpa) 
     VALUES (1, 'Jack', 2.3);

SELECT * from Students;

Actually no.  We haven't yet specified the primary key and hence **there is no entity integrity**.  If we impose a primary key constraint we observe the behavior we expect:

In [ ]:
%%sql
drop table if exists Students CASCADE;

create table Students(
    PRIMARY KEY(sID), -- we impose entity integrity
    sId int,
    name text,
    gpa numeric(3,2) 
);

In [ ]:
%%sql

INSERT INTO Students (sid, name, gpa) 
     VALUES (1, 'Jack', 2.3);
    
select * from Students;

Now inserting a row with the same primary key will cause an error. Uncomment and run the below

In [ ]:
#%sql INSERT INTO Students (sid, name, gpa) VALUES ('1', 'Jack', 2.3);

---
## Referential Integrity

To maintain referential integrity four types of constraints can be specified `ON DELETE` or `ON UPDATE`

1. `RESTRICT` or `NO ACTION`
2. `CASCADE`
2. `SET NULL`
3. `SET DEFAULT`

e.g.,

```
create table Grades(
    sId int, 
        FOREIGN KEY REFERENCES Students(sId),
        ON UPDATE NO ACTION,
    cId int, 
    grade CHAR(2)
);
```

Lets try it out.

In [ ]:
%%sql

drop table if exists Students CASCADE;
drop table if exists Courses CASCADE;
drop table if exists Grades CASCADE;

create table Students(
    primary key(sId),
    sId int,
    name text,
    gpa numeric(3,2) 
);

create table Courses(
    primary key(cID),
    cId int,  
    name text,
    units int
);

create table Grades(
    sId int, 
    cId int, 
    letter_grade CHAR(2)
);

We now hand stich together rows in these tables

In [ ]:
%%sql
 
INSERT INTO Students (sid, name, gpa) 
     VALUES (1, 'Jack', 2.3),
            (2, 'Jill', 3.3),
            (3, 'Pat', 3.9);
            
INSERT INTO Courses (cId, name, units)
     VALUES (1, 'Database Design and Development', 12),
            (2, 'Practical Data Science', 9),
            (3, 'Big Data Analytics', 6);
            
INSERT INTO Grades( sId, cId, letter_grade)
     VALUES (1, 1, 'A'),
            (1, 2, 'A+'),
            (2, 3, 'B');

In [ ]:
def print_all_tables():
    s = %sql select * from Students; 
    c = %sql select * from Courses;
    g = %sql select * from Grades;
    print("\nStudents:\n%s" % s)
    print("\nCourses:\n%s" % c)
    print("\nGrades:\n%s" % g)
    
print_all_tables()

In [ ]:
%%sql

DELETE FROM Students
      WHERE sid = 1;

In [ ]:
print_all_tables()

Note that Jack (with sid=1) has been deleted but Grades still refers to sid=1 !  A referential integrity violation.

Now, lets place a referential constraint and see what happens

In [ ]:
%%sql

drop table if exists Students CASCADE;
drop table if exists Courses CASCADE;
drop table if exists Grades CASCADE;

create table Students(
    primary key(sId),
    sId int,
    name text,
    gpa numeric(3,2) 
);

create table Courses(
    primary key(cID),
    cId int,  
    name text,
    units int
);

create table Grades(
    sId int, 
        -- foreign key (sid) references Students(sid),
        -- on delete restrict, 
        -- on delete cascade,
    cId int,   -- !!! Note that we haven't placed a constraint on cid'
        -- foreign key (cId) references Courses(cId)
        -- on delete set NULL,
    grade CHAR(2)
);

 
INSERT INTO Students (sid, name, gpa) 
     VALUES (1, 'Jack', 2.3),
            (2, 'Jill', 3.3),
            (3, 'Pat', 3.9);
            
INSERT INTO Courses (cId, name, units)
     VALUES (1, 'Database Design and Development', 12),
            (2, 'Practical Data Science', 9),
            (3, 'Big Data Analytics', 6);
            
INSERT INTO Grades( sId, cId, grade)
     VALUES (1, 1, 'A'),
            (1, 2, 'A+'),
            (2, 3, 'B');

In [ ]:
print_all_tables()

We again delete student with id=1

In [ ]:
%%sql

delete from Students
   where sid = 1;

In [ ]:
print_all_tables()

When dealing with foreign keys we have both a "referencing field" (R.fk) and a "referenced field" (S.pk).  Which of the following operations could cause a referential integrity violation?  Mark a y if a RI violation is possible.


| R.fk   | S.pk  |  violation (y or n) |addressable | 
|:------:|:-----:|:-------------------:|:-----------:
| insert |       |                     |            |
| delete |       |                     |            |
| update |       |                     |            |
|        |insert |                     |            |
|        |delete |                     |            |
|        |update |                     |      .     |

## Triggers Introduction

Triggers are used to execute sql commands upon changes to the specified tables.  To create a new trigger in PostgreSQL, you need to:

1. Create a trigger function using `CREATE FUNCTION` statement.
2. Bind this trigger function to a table using `CREATE TRIGGER` statement.

In [ ]:
%%sql

DROP TABLE if EXISTS Employees;
DROP TABLE if EXISTS Departments;

CREATE TABLE Employees(
    eID int, 
    name text, 
    dID int);

CREATE TABLE Departments(
    dID int, 
    name text, 
    employee_count int ); -- default 0);  -- note the default value

insert into Departments (dID, name, employee_count)
     values (1,'HR', 0),
            (2,'Engineering', 0);

At this point, there are no empoloyees in the Employee table.  As you can see below, each department has 0 employees.

In [ ]:
%%sql

select did, name, employee_count
  from Departments;

Create a trigger to increment the count of employees each time a new employee is inserted

In [ ]:
%%sql 

CREATE OR REPLACE FUNCTION fn_update_employee_count() RETURNS trigger AS $_$
BEGIN
  update   Departments 
     set   employee_count = employee_count + 1 
   where   dID = new.dID;
  return   new;
END $_$ LANGUAGE 'plpgsql';

DROP TRIGGER IF EXISTS tr_update_employee_count ON Employees; 

CREATE TRIGGER tr_update_employee_count AFTER INSERT ON Employees
  FOR EACH ROW
  EXECUTE PROCEDURE fn_update_employee_count();

When we insert several employees into the Employee table, the trigger should fire and update values in the Department table.

In [ ]:
%%sql

insert into Employees (eID, name, dID)
     values (1,'Todd',1),
            (2,'Jimmy',1),
            (3,'Billy',2);

Now when we view the employee table, we see that the employee count has been updated by the trigger.

In [ ]:
%%sql

select did, name, employee_count
from Departments;

## Activity: Trigger for Calculating GPA

In [ ]:
%%sql

drop table if exists Students CASCADE;
drop table if exists Courses CASCADE;
drop table if exists Grades CASCADE;

-- For simplicity there are NO CONSTRAINTS in the below
-- Also, note that the grade for courses is now Numeric

create table Students(
    sId int,
    name text,
    gpa numeric(3,2) 
);

create table Courses(
    cId int,  
    name text,
    units int
);

create table Grades(
    sId int, 
    cId int,   
    score numeric(2,1)  --  <--- now numeric
);

 
INSERT INTO Students (sid, name) -- <-- gpa not entered
     VALUES (1, 'Jack'),
            (2, 'Jill'),
            (3, 'Pat');
            
INSERT INTO Courses (cId, name, units)
     VALUES (1, 'Database Design and Development', 12),
            (2, 'Practical Data Science', 9),
            (3, 'Big Data Analytics', 6);
            
INSERT INTO Grades( sId, cId, score)
     VALUES (1, 1, 4.0),
            (1, 2, 3.7),
            (2, 3, 3.0);

In [ ]:
print_all_tables()

In [ ]:
%%sql

CREATE OR REPLACE FUNCTION fn_update_gpa() RETURNS trigger AS $_$
BEGIN 
    UPDATE Students

    --- TODO
        
        
     WHERE sid = new.sid;
  return   new;
END $_$ LANGUAGE 'plpgsql';

DROP TRIGGER IF EXISTS tr_update_gpa ON Grades;

CREATE TRIGGER tr_update_gpa AFTER INSERT ON Grades
  FOR EACH ROW
  EXECUTE PROCEDURE fn_update_gpa();

In [ ]:
%%sql

insert into Grades (sid, cid, score)
     values (2,1,3.7);

In [ ]:
print_all_tables()

In [ ]:
# cid 3 / 6 units / 3.0
# cid 1 / 12 units / 3.7
%sql select ((6*3.0 + 12*3.7) / (6.0+12.0)) as "gpa";

## Activity:  Write a trigger such that if a person's GPA goes above 3.5 then they are inserted into a Dean's honors list

In [ ]:
%%sql

drop table if exists Deans_List;
create table deans_list (
     name  text,
     gpa   numeric(3,2)
);

CREATE OR REPLACE FUNCTION fn_update_deans_list() RETURNS trigger AS $_$
BEGIN 
        -- TODO
    
END $_$ LANGUAGE 'plpgsql';

DROP TRIGGER IF EXISTS tr_update_deans_list ON students;

CREATE TRIGGER tr_update_deans_list AFTER update of gpa on students
  FOR EACH ROW
  when (new.gpa > 3.5)
  EXECUTE PROCEDURE fn_update_deans_list();

In [ ]:
%%sql

insert into Grades (sid, cid, score)
     values (3,1,3.7);

In [ ]:
# print_all_tables()

%sql select * from deans_list;